src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(_, __)
    Объект.Наименование = составитьФио(Объект.Фамилия, Объект.Имя, Объект.Отчество);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФамилияПриИзменении(редактируемыйЭлементФормы)
    заполнитьПолеФормыФио(редактируемыйЭлементФормы);
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(редактируемыйЭлементФормы)
    заполнитьПолеФормыФио(редактируемыйЭлементФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(редактируемыйЭлементФормы)
    заполнитьПолеФормыФио(редактируемыйЭлементФормы);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура заполнитьПолеФормыФио(редактируемыйЭлементФормы)
    текстРедактирования = редактируемыйЭлементФормы.ТекстРедактирования;

    Попытка
        Если редактируемыйЭлементФормы.Имя = "Фамилия" Тогда
            Объект.Фамилия = очиститьФиоПоМаске(текстРедактирования);
        ИначеЕсли редактируемыйЭлементФормы.Имя = "Имя" Тогда
            Объект.Имя = очиститьФиоПоМаске(текстРедактирования);
        ИначеЕсли редактируемыйЭлементФормы.Имя = "Отчество" Тогда
            Объект.Отчество = очиститьФиоПоМаске(текстРедактирования);
        КонецЕсли;

        Объект.Наименование = составитьФио(Объект.Фамилия, Объект.Имя, Объект.Отчество);
    Исключение
        сообщение = Новый СообщениеПользователю();
        сообщение.Текст = СтрШаблон("Неверный формат ввода для поля ""%1"".", редактируемыйЭлементФормы.Имя);
        сообщение.Поле = редактируемыйЭлементФормы.Имя;
        сообщение.КлючДанных = Объект.Ссылка;
        сообщение.ПутьКДанным = "Объект";
        сообщение.Сообщить();
    КонецПопытки;
КонецПроцедуры

&НаСервере
Функция очиститьФиоПоМаске(Знач стрФио)
    стрФио = СтрЗаменитьПоРегулярномуВыражению(стрФио, "\s+", "");
    результатПоиска = СтрНайтиПоРегулярномуВыражению(
            стрФио, "^(?:[^а-яА-ЯЁё]+)?([а-яА-ЯЁё]+)((?:\-[а-яА-ЯЁё]+)?)(?:[^а-яА-ЯЁё]+)?$");

    Если результатПоиска.НачальнаяПозиция > 0 Тогда
        группыПоиска = результатПоиска.ПолучитьГруппы();
        Если ЗначениеЗаполнено(группыПоиска)
            И группыПоиска[0].НачальнаяПозиция > 0 И группыПоиска.Количество() >= 1 Тогда

            результат = группыПоиска[0].Значение;
            результат = ВРег(Лев(результат, 1)) + НРег(Сред(результат, 2));

            группыПоиска.Удалить(0);
            Для Каждого группа Из группыПоиска Цикл
                Если группа.НачальнаяПозиция > 0 Тогда
                    результат = результат + ВРег(Лев(группа.Значение, 2)) + НРег(Сред(группа.Значение, 3));
                КонецЕсли;
            КонецЦикла;

            Возврат результат;
        КонецЕсли;
    Иначе
        ВызватьИсключение("Ошибка. Неверный формат ввода.");
    КонецЕсли;
КонецФункции

&НаКлиенте
Функция составитьФио(Знач фамилия, Знач имя, Знач отчество)
    Возврат СокрЛП(СтрШаблон("%1 %2 %3", фамилия, имя, отчество));
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
